trunk/ kltn-qlcbsgu/app/controllers/casein/can_bo_thong_tins_controller.rb

      paginate_conditions = ['don_vi_id = ?', don_vi] if don_vi != 0

      if search_value != nil
        @can_bo_thong_tins = CanBoThongTin.search(search_value, don_vi).paginate(:per_page => view, :page => params[:page], :conditions => paginate_conditions, :order => order)
---
SELECT COUNT(*) FROM `can_bo_thong_tins` WHERE (ma_cb = '1990-02-02' OR ho_ten LIKE '%1990-02-02%' OR ngay_sinh = '1990-02-02' OR so_cmnd = '1990-02-02')
SELECT `can_bo_thong_tins`.* FROM `can_bo_thong_tins` WHERE (ma_cb = '1990-02-02' OR ho_ten LIKE '%1990-02-02%' OR ngay_sinh = '1990-02-02' OR so_cmnd = '1990-02-02') LIMIT 10 OFFSET 0

    def edit
      @casein_page_title = Param.get_param_value("can_bo_thong_tin_edit_page_title")
      @can_bo_thong_tin = CanBoThongTin.find params[:id]
---
SELECT `can_bo_thong_tins`.* FROM `can_bo_thong_tins` WHERE `can_bo_thong_tins`.`id` = 1 LIMIT 1

    def show

      @lich_su_bac_luongs = []
      @can_bo_trinh_do = nil
      @than_nhans = []
      @qua_trinh_cong_tacs = []
      @can_bo_cong_tac = nil

      @casein_page_title = Param.get_param_value("can_bo_thong_tin_show_page_title")
      @can_bo_thong_tin = CanBoThongTin.find params[:id]
---
SELECT `can_bo_thong_tins`.* FROM `can_bo_thong_tins` WHERE `can_bo_thong_tins`.`id` = 1 LIMIT 1

    def create
      @can_bo_thong_tin = CanBoThongTin.new params[:can_bo_thong_tin]
      #image uploader
      my_image = params[:can_bo_thong_tin][:hinh_anh]
      image_uploader = ImageUploader.new
      image_uploader.store!(my_image)
      image_uploader.retrieve_from_store!('my_image.png')
      #file uploader
      my_file = params[:can_bo_thong_tin][:tep_tin_dinh_kem]
      file_uploader = FileUploader.new
      file_uploader.store!(my_file)
      file_uploader.retrieve_from_store!('my_file.doc')

      if params[:can_bo_thong_tin][:ten_goi_khac] == ""
        params[:can_bo_thong_tin][:ten_goi_khac] = params[:can_bo_thong_tin][:ho_ten]
      end

      quyet_dinh = QuyetDinh.find_by_so_qd(@can_bo_thong_tin.so_quyet_dinh)
      if quyet_dinh
        @can_bo_thong_tin.quyet_dinh_id = quyet_dinh.id
        if @can_bo_thong_tin.save
---
INSERT INTO `can_bo_thong_tins` (`created_at`, `dan_toc`, `gioi_tinh`, `hinh_anh`, `ho_ten`, `is_deleted`, `ma_cb`, `ngay_cap_cmnd`, `ngay_sinh`, `noi_dang_ky_ho_khau_thuong_tru`, `noi_o_hien_nay`, `noi_sinh`, `que_quan`, `so_BHXH`, `so_cmnd`, `ten_goi_khac`, `tep_tin_dinh_kem`, `ton_giao`, `updated_at`) VALUES ('2013-02-21 02:59:17', 'Kinh', 1, NULL, 'Dương Đình Dũng', 0, '10004', '2007-02-21', '1994-02-21', 'Nha Trang, Khánh Hòa', '994B/33E Huỳnh Tấn Phát, Quận 7, TP.HCM', 'Cam Ranh, Khánh Hòa', 'Nha Trang, Khánh Hòa', '2145534', '2255001324', 'Dũng Dương', NULL, 'Thiên Chúa', '2013-02-21 02:59:17')

    def update
      @casein_page_title = Param.get_param_value("can_bo_thong_tin_update_page_title")

      #image uploader
      my_image = params[:can_bo_thong_tin][:hinh_anh]
      image_uploader = ImageUploader.new
      image_uploader.store!(my_image)
      #file uploader
      my_file = params[:can_bo_thong_tin][:tep_tin_dinh_kem]
      file_uploader = FileUploader.new
      file_uploader.store!(my_file)

      if params[:can_bo_thong_tin][:ten_goi_khac] == ""
        params[:can_bo_thong_tin][:ten_goi_khac] = params[:can_bo_thong_tin][:ho_ten]
      end

      @can_bo_thong_tin = CanBoThongTin.find params[:id]

      quyetdinh = QuyetDinh.find_by_so_qd(params[:can_bo_thong_tin][:so_quyet_dinh])
        if quyetdinh
          @can_bo_thong_tin.update_attribute(:quyet_dinh_id, quyetdinh.id)
---
SELECT `can_bo_thong_tins`.* FROM `can_bo_thong_tins` WHERE `can_bo_thong_tins`.`id` = 1 LIMIT 1
UPDATE `can_bo_thong_tins` SET `que_quan` = 'Nha Trang, Khánh Hòa', `noi_dang_ky_ho_khau_thuong_tru` = 'Nha Trang, Khánh Hòa', `updated_at` = '2013-02-02 03:00:44' WHERE `can_bo_thong_tins`.`id` = 1

    def destroy
      @can_bo_thong_tin = CanBoThongTin.find params[:id]

      @can_bo_thong_tin.update_attributes(:is_deleted => true)
---
SELECT `can_bo_thong_tins`.* FROM `can_bo_thong_tins` WHERE `can_bo_thong_tins`.`id` = 1 LIMIT 1
UPDATE `can_bo_thong_tins` SET `is_deleted` = 1, `updated_at` = '2013-02-02 16:02:32' WHERE `can_bo_thong_tins`.`id` = 1

    def advance_search
      @casein_page_title = Param.get_param_value("can_bo_thong_tin_advance_search_page_title")
      search_advance_req = params["search_advance_req"]
      if search_advance_req!= nil and search_advance_req.length>0
        @can_bo_thong_tin = CanBoThongTin.new params[:can_bo_thong_tin]
        options = {}
        #gioi_tinh to hash
        if params[:can_bo_thong_tin][:search_by_gioi_tinh].to_s != "all"
          options = options.merge(:gioi_tinh =>  params[:can_bo_thong_tin][:search_by_gioi_tinh].to_s)
        end
         #each attribute to hash, except gioi_tinh, ngay_sinh,
         @can_bo_thong_tin.attributes.each do |attr_name, attr_value|
             if attr_value.to_s.length>0 && attr_name !='gioi_tinh' && attr_name !='is_deleted'
                options = options.merge(attr_name =>attr_value)
             end
         end
        if @can_bo_thong_tin.don_vi_id.to_s.length>0
---
SELECT COUNT(*) FROM `can_bo_thong_tins` WHERE (ma_cb = '11' AND ho_ten LIKE '%%' AND dan_toc LIKE '%%' AND noi_o_hien_nay LIKE '%%' AND so_cmnd LIKE '%%' AND noi_dang_ky_ho_khau_thuong_tru LIKE '%%')

        # set sql excute query is_deleted = false (only get employee not deleted)
        options = options.merge(:is_deleted =>  false)

        @can_bo_thong_tins = CanBoThongTin.search_advance(options).paginate(:per_page => 10, :page => params[:page])
---
SELECT `can_bo_thong_tins`.* FROM `can_bo_thong_tins` WHERE (ho_ten LIKE '%%' AND dan_toc LIKE '%%' AND noi_o_hien_nay LIKE '%%' AND so_cmnd LIKE '%%' AND noi_dang_ky_ho_khau_thuong_tru LIKE '%%') LIMIT 10 OFFSET 0