 kltn-qlcbsgu/app/views/casein/than_nhans/_form.html.erb

<div class="tfContainer">
  <%= casein_select f, f.object, :can_bo_thong_tin_id, CanBoThongTin.all.collect {|p| [ "#{p.ma_cb} - #{p.ho_ten}", p.id ] }, {:include_blank => '', :casein_label => "Cán bộ"} %>
---
SELECT `can_bo_thong_tins`.* FROM `can_bo_thong_tins`