 kltn-qlcbsgu/app/controllers/casein/can_bo_li_lich_cts_controller.rb

SELECT `can_bo_li_lich_cts`.* FROM `can_bo_li_lich_cts` LIMIT 30 OFFSET 0
---
    def index
      @casein_page_title = Param.get_param_value("can_bo_li_lich_ct_index_page_title")
      search_value = params["keyword"]
      if search_value
        @can_bo_li_lich_cts = CanBoLiLichCt.search(search_value).paginate(:per_page => 10, :order => "can_bo_thong_tin_id", :page => params[:page])