 kltn-qlcbsgu/app/controllers/casein/params_controller.rb

    def index
      @casein_page_title = Param.get_param_value("param_index_page_title")
      search_value = params["keyword"]
      if search_value != nil
        @params = Param.search(search_value).sort_by("param_name").paginate(:per_page => 10, :page => params[:page])
---
SELECT COUNT(*) FROM `params` WHERE (param_name LIKE '%add%')
SELECT `params`.* FROM `params` WHERE (param_name LIKE '%a%') ORDER BY param_name LIMIT 10 OFFSET 0

    def show
      @casein_page_title = Param.get_param_value("param_show_page_title")
      @param = Param.find params[:id]
---
SELECT `params`.* FROM `params` WHERE `params`.`id` = 5 LIMIT 1

    def create
      @param = Param.new params[:param]

      if @param.save
---
INSERT INTO `params` (`created_at`, `description`, `options`, `param_name`, `param_value`, `updated_at`) VALUES ('2013-03-01 03:27:03', 'Thông báo thành công khi thêm mới cán bộ thông tin', '', 'adding_success', 'Đã thêm dữ liệu thành công!', '2013-03-01 03:27:03')

    def update
      @casein_page_title = Param.get_param_value("param_update_page_title")

      @param = Param.find params[:id]

      if @param.update_attributes params[:param]
---
SELECT `params`.* FROM `params` WHERE `params`.`id` = 5 LIMIT 1
UPDATE `params` SET `param_name` = 'must_be_an_correctly_email', `param_value` = 'email không hợp lệ', `description` = 'Thông báo email không hợp lệ', `updated_at` = '2013-03-04 03:19:33' WHERE `params`.`id` = 39

    def destroy
      @param = Param.find params[:id]

      @param.destroy
---
SELECT `params`.* FROM `params` WHERE `params`.`id` = 2 LIMIT 1
DELETE FROM `params` WHERE `params`.`id` = 2