 kltn-qlcbsgu/app/controllers/casein/than_nhans_controller.rb

    def index
      @casein_page_title = Param.get_param_value('than_nhan_index_page_title')
      search_value = params["keyword"]
      if search_value
        @than_nhans = ThanNhan.search(search_value).paginate(:per_page => 10, :order => "can_bo_thong_tin_id", :page => params[:page])
---
SELECT `than_nhans`.* FROM `than_nhans` LIMIT 30 OFFSET 0

    def show
      @casein_page_title = Param.get_param_value('than_nhan_show_page_title')
      @than_nhan = ThanNhan.find params[:id]
---
SELECT `than_nhans`.* FROM `than_nhans` WHERE `than_nhans`.`id` = 1 LIMIT 1

    def create
      @than_nhan = ThanNhan.new params[:than_nhan]

      if @than_nhan.save
---
INSERT INTO `than_nhans` (`can_bo_thong_tin_id`, `created_at`, `nam_sinh`, `nghe_nghiep`, `quan_he_voi_cb`, `updated_at`) VALUES (38, '2013-03-04 05:35:29', 1950, 'Làm nông', 'Cha', '2013-03-04 05:35:29')

    def update
      @casein_page_title = Param.get_param_value('than_nhan_update_page_title')

      @than_nhan = ThanNhan.find params[:id]

      if @than_nhan.update_attributes params[:than_nhan]
---
SELECT `than_nhans`.* FROM `than_nhans` WHERE `than_nhans`.`id` = 1 LIMIT 1
UPDATE `than_nhans` SET `ho_ten` = 'Huỳnh Văn Long', `updated_at` = '2013-03-04 07:07:46' WHERE `than_nhans`.`id` = 1