 kltn-qlcbsgu/app/controllers/casein/users_controller.rb

UPDATE `casein_users` SET `last_request_at` = '2013-03-02 03:49:26', `perishable_token` = 'Sbm4NoZNNK86v0QTKGp', `updated_at` = '2013-03-02 03:49:26' WHERE `casein_users`.`id` = 1
---
    def update
      @casein_user = Casein::User.find params[:id]
      @casein_page_title = @casein_user.name + " | #{Param.get_param_value("users_update_page_title")}"

      if @casein_user.update_attributes params[:casein_user]

UPDATE `casein_users` SET `last_request_at` = '2013-03-03 06:44:21', `perishable_token` = 'YVaCCOPme19nLqjjnPt', `updated_at` = '2013-03-03 06:44:21' WHERE `casein_users`.`id` = 1
---
    def reset_password
      @casein_user = Casein::User.find params[:id]
      @casein_page_title = @casein_user.name + " | #{Param.get_param_value("users_reset_password_page_title")}"

      @casein_user.notify_of_new_password = true unless @casein_user.id == @session_user.id

      if @casein_user.update_attributes params[:casein_user]