 kltn-qlcbsgu/app/views/casein/can_bo_li_lich_cts/_form.html.erb

<div class="tfContainer" xmlns="http://www.w3.org/1999/html" xmlns="http://www.w3.org/1999/html">
	<%= casein_select f, f.object, :can_bo_thong_tin_id, CanBoThongTin.can_bo_chua_co_li_lich_ct.collect {|p| [ "#{p.ma_cb} - #{p.ho_ten}", p.id ] }, {:include_blank => '', :casein_label => "Cán bộ"} %>
---
SELECT `can_bo_thong_tins`.* FROM `can_bo_thong_tins`